<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"64a5b9fa7437bd382361dce09eb5b1dab312b6bfa542af5349bb9d3337bc355f","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1155 at https://github.com/cal-itp/data-infra/actions/runs/20049009477","plan_out_hash":"0857b2644f893a5e77a057861646c0df8f41e2d5f8ab9ebe58134ebd6aac87f9","plan_hash":"d425d2140ba0f8388bb1345ab6c3d439469f531ccdfd82bde3406a44c3cdb6b2","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 15 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "G0BNVQ==" -> (known after apply)
!~      detect_md5hash      = "MXFYtPprsFpWte9yivjiHQ==" -> "different hash"
!~      generation          = 1765240133053963 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "MXFYtPprsFpWte9yivjiHQ==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"] will be destroyed
  # (because key ["plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/zip" -> null
-       crc32c              = "1hT7ow==" -> null
-       detect_md5hash      = "omifem08VTXEfwdktvRcLQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1764982222490193 -> null
-       id                  = "calitp-staging-composer-plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       md5hash             = "omifem08VTXEfwdktvRcLQ==" -> null
-       md5hexhash          = "a2689f7a6d3c5535c47f0764b6f45c2d" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Fgtfs_validator%2Fgtfs-validator-7.1.0-cli.jar?generation=1764982222490193&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       output_name         = "plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Fgtfs_validator%2Fgtfs-validator-7.1.0-cli.jar" -> null
-       source              = "../../../../airflow/plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_unzip_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "XQnobQ==" -> (known after apply)
!~      detect_md5hash      = "avTaZ7Bc+D4hSFXvd+F6hQ==" -> "different hash"
!~      generation          = 1764982216063710 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_unzip_hook.py"
!~      md5hash             = "avTaZ7Bc+D4hSFXvd+F6hQ==" -> (known after apply)
        name                = "plugins/hooks/gtfs_unzip_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "EwZmVA==" -> (known after apply)
!~      detect_md5hash      = "pAwefvyTF+k+iBxeXN8WmA==" -> "different hash"
!~      generation          = 1765240133054057 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "pAwefvyTF+k+iBxeXN8WmA==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "KvENpw==" -> (known after apply)
!~      detect_md5hash      = "T4VqE/DM0g8dGIROGUZ4Ww==" -> "different hash"
!~      generation          = 1764982216077464 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "T4VqE/DM0g8dGIROGUZ4Ww==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "WyCWfQ==" -> (known after apply)
!~      detect_md5hash      = "nSmV74J3dcKLjuQCz0lQtA==" -> "different hash"
!~      generation          = 1765240133081069 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "nSmV74J3dcKLjuQCz0lQtA==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "rKY4fQ==" -> (known after apply)
!~      detect_md5hash      = "bbZCoqIJ3x0hUmg/Cst4ww==" -> "different hash"
!~      generation          = 1764984048949175 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "bbZCoqIJ3x0hUmg/Cst4ww==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "sjIQ3w==" -> (known after apply)
!~      detect_md5hash      = "F20c+qNAWzVNPlr8UfLEkQ==" -> "different hash"
!~      generation          = 1764982216058197 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "F20c+qNAWzVNPlr8UfLEkQ==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "aa0zBg==" -> (known after apply)
!~      detect_md5hash      = "DB0rN1eMI6EmyMzB+/Q/0A==" -> "different hash"
!~      generation          = 1764982215937399 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "DB0rN1eMI6EmyMzB+/Q/0A==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "90dyPA==" -> (known after apply)
!~      detect_md5hash      = "WG9X8aeYYRuHaIlLed6xkQ==" -> "different hash"
!~      generation          = 1765240133999929 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "WG9X8aeYYRuHaIlLed6xkQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs_quality/int_gtfs_quality__schedule_validator_rule_details_unioned.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "hFPoMg==" -> (known after apply)
!~      detect_md5hash      = "tUCc7PC0+Sx80IeBEYrPfA==" -> "different hash"
!~      generation          = 1765240133079899 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__schedule_validator_rule_details_unioned.sql"
!~      md5hash             = "tUCc7PC0+Sx80IeBEYrPfA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__schedule_validator_rule_details_unioned.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/payments/_int_payments.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "wODMcA==" -> (known after apply)
!~      detect_md5hash      = "tuYyCRja13CEhEblQn7u/A==" -> "different hash"
!~      generation          = 1749663116399571 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/payments/_int_payments.yml"
!~      md5hash             = "tuYyCRja13CEhEblQn7u/A==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/payments/_int_payments.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/payments/int_payments__refunds_to_aggregations.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "HxjT6g==" -> (known after apply)
!~      detect_md5hash      = "zZIja39dr1TtsxxCA/4kIg==" -> "different hash"
!~      generation          = 1749663116775029 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/payments/int_payments__refunds_to_aggregations.sql"
!~      md5hash             = "zZIja39dr1TtsxxCA/4kIg==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/payments/int_payments__refunds_to_aggregations.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/payments/littlepay_feed_unions/int_littlepay__unioned_refunds.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "L8ggEw==" -> (known after apply)
!~      detect_md5hash      = "glUiaPQIv7b7qMen0eNG5w==" -> "different hash"
!~      generation          = 1760473645067313 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/payments/littlepay_feed_unions/int_littlepay__unioned_refunds.sql"
!~      md5hash             = "glUiaPQIv7b7qMen0eNG5w==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/payments/littlepay_feed_unions/int_littlepay__unioned_refunds.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_quality/_mart_gtfs_quality.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "6mM2hg==" -> (known after apply)
!~      detect_md5hash      = "+wP9c8v4YUh5DO52Pf2+Lw==" -> "different hash"
!~      generation          = 1765240133086081 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs_quality/_mart_gtfs_quality.yml"
!~      md5hash             = "+wP9c8v4YUh5DO52Pf2+Lw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_quality/_mart_gtfs_quality.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv"] will be destroyed
  # (because key ["seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "HiMSzg==" -> null
-       detect_md5hash      = "REBfI/kjd8XOSStDQgOZEg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1764012980587419 -> null
-       id                  = "calitp-staging-composer-data/warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       md5hash             = "REBfI/kjd8XOSStDQgOZEg==" -> null
-       md5hexhash          = "44405f23f92377c5ce492b4342039912" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fseeds%2Fgtfs_schedule_validator_rule_details_v7_1_0.csv?generation=1764012980587419&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       output_name         = "data/warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fseeds%2Fgtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       source              = "../../../../warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "uvbxzA==" -> (known after apply)
!~      detect_md5hash      = "SO7h8JdugtrtNvqQ/lr9nQ==" -> "different hash"
!~      generation          = 1765240135116821 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "SO7h8JdugtrtNvqQ/lr9nQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 15 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1155](https://github.com/cal-itp/data-infra/actions/runs/20049009477)